/***********************************************************************
* 文 件 名 称 ： LedCtrlIf.h
* 功 能 描 述 ： 
* 开 发 人 员 ： yy.lee
* 日期       版本  修改人    描述
* ========== ======= ========= =======================================
* 2020-07-20 V1.0       Create
*
* @Copyright (C)  2020  .wanji. all right reserved
***********************************************************************/
#ifndef __LedCtrlIf_H__
#define __LedCtrlIf_H__
/**********************  头文件包含  ********************************/
#include "MiscIf.h"
/********************** 宏定义 *************************************/

/********************** 类型重定义 **********************************/
typedef struct _LEDCtalgrcv{
	long mtype;
    int m_int32BlockIndex;  
    int m_int32LEDState;  
}LEDCtalgrcv;
/********************** 函数外部申明 ********************************/

#endif /* __LedCtrlIf_H__ */

